<template>
    <div>
        <div class="blacking"
             @click="hideSelf"></div>
        <div class="agreement-container">
            <div class="close"
                 @click="hideSelf">X
            </div>
            <div class="agreement-text">
                <div class="agreement-header">
                    Согласие на обработку запроса
                </div>
                <div class="agreement-part">
                    <b>Конфиденциальность и условия использования.</b>
                    <br>
                    <br>
                    Приветствуем Вас на сайте callkeeper.ru. Мы рады проявленному Вами интересу к нашей
                    компании и оказываемым нами услугам. ООО «КоллКипер» со всей серьезностью
                    относится к соблюдению права каждого посетителя на конфиденциальность в отношении
                    персональных данных и принимает физические, административные и технические меры
                    по защите любой информации, предоставляемой в режиме «онлайн». В большинстве
                    случаев, при посещении сайта callkeeper.ru, пользователи не сообщают и не раскрывают
                    никакой информации, относящейся к персональным данным. Однако, при использовании
                    специальных возможностей сайта, требуется предоставление такой информации, причем в
                    исключительно необходимом для этого объеме. Обработка персональных данных
                    посетителей производится в соответствии с требованиями Федерального закона №152-ФЗ
                    «О персональных данных» от 27 июля 2006 года. ООО «КоллКипер» является
                    зарегистрированным оператором персональных данных № 77-16-004732 в реестре
                    Роскомнадзора. Данные, которые мы собираем о пользователях в России, безопасно
                    хранятся на серверах, расположенных в Российской Федерации.
                    <br>
                    <br>
                    Просим Вас ознакомиться с содержанием настоящего соглашения о конфиденциальности
                    и защите персональных данных (далее — «Соглашение»). Если во время посещения сайта
                    Вы принимаете решение зарегистрироваться или предоставить Ваши персональные
                    данные, Вы тем самым даете свое безоговорочное согласие на использование указанной
                    информации ООО «КоллКипер» в соответствии с условиями настоящего Соглашения. В
                    случае несогласия с этими условиями, Вам следует воздержаться от просмотра нашего
                    веб-сайта и использования сервиса CallKeeper.
                    <br>
                    <br>
                    Если Вы являетесь посетителем стороннего веб-сайта, на котором используется сервис
                    CallKeeper, то любые предоставляемые вами данные на данном ресурсе собираются
                    в соответствии с политикой о персональных данных данного веб-сайта (компании).
                    <br>
                    <br>
                    <b>Состав персональных данных.</b>
                    <br>
                    <br>
                    Персональные данные это любая информация, относящаяся к прямо или косвенно
                    определенному, или определяемому физическому лицу. К такой информации, в частности,
                    можно отнести: ФИО, год, месяц, дата и место рождения, адрес, сведения о семейном,
                    социальном, имущественном положении, сведения об образовании, профессии, доходах,
                    а также другую информацию.
                    <br>
                    <br>
                    Все обрабатываемые нами персональные данные являются конфиденциальной, строго
                    охраняемой информацией в соответствии с применимым законодательством.
                    Обработка персональных данных это любое действие (операция) или совокупность
                    действий (операций) с персональными данными, совершаемых с использованием средств
                    автоматизации или без использования таких средств. К таким действиям (операциям)
                    можно отнести: сбор, получение, запись, систематизацию, накопление, хранение,
                    уточнение (обновление, изменение), извлечение, использование, передачу
                    (распространение, предоставление, доступ), обезличивание, блокирование, удаление,
                    уничтожение персональных данных.
                    <br>
                    <br>
                    <b>Сбор и обработка персональных данных.</b>
                    <br>
                    <br>
                    ООО «КоллКипер» осуществляет сбор только той персональной информации, которую
                    пользователь предоставляет добровольно. Персональные данные, собираемые нами могут
                    включать, но не ограничиваться следующими данными: Ваше имя, адрес электронной
                    почты, номер телефона.
                    <br>
                    <br>
                    Любая предоставленная Вами при использовании настоящего сайта информация,
                    относящаяся к персональным данным, будет использована ООО «КоллКипер» только для
                    целей, указанных ниже. Предоставляя информацию при использовании настоящего сайта,
                    а также посредством любых иных обращений в ООО «КоллКипер», Вы выражаете свое
                    согласие с тем, что соответствующая информация может хранится и использоваться ООО
                    «КоллКипер» в настоящее время и в дальнейшем в целях:
                    <br>
                    <br>
                    - предоставления доступа к Сервису CallKeeper;
                    <br>
                    - предоставления Вам информации о продуктах, услугах и мероприятиях, которые могут
                    представлять для Вас интерес;
                    <br>
                    - проведения маркетинговых исследований для улучшения качества продукции и услуг
                    ООО «КоллКипер»;
                    <br>
                    - выполнение ООО «КоллКипер» своих обязательств, в рамках оказываемых услуг, на
                    основании заключенных договоров (выполнение договорных обязательств);
                    <br>
                    - ответов на Ваши запросы;
                    <br>
                    - технического администрирования страниц сайта;
                    <br>
                    - управления клиентской базой;
                    <br>
                    - проведения анкетных опросов по продукции и маркетинга;
                    <br>
                    - а также в целях предоставления субъекту персональных данных информации
                    коммерческого и информационного характера через различные каналы связи, в том числе
                    по почте, смс, электронной почте, телефону, если субъект персональных данных изъявит
                    желание на получение подобной информации соответствующими средствами связи.
                    <br>
                    <br>
                    Сбору подлежат такие данные как фамилия, имя, почтовый адрес, адрес электронной
                    почты, номер телефона, а также некоторая вторичная информация, например, файлы
                    cookies, данные о подключении к сети и системная информация.
                    <br>
                    <br>
                    Кроме того, мы можем использовать сторонние сервисы (такие как Google Analytics,
                    Яндекс.Метрика). Эти сторонние сервисы имеют свои собственные политики
                    конфиденциальности, описывающие как они используют предоставленную информацию.
                    <br>
                    <br>
                    <b>Контроль и разрешение использования персональных данных.</b>
                    <br>
                    <br>
                    ООО «КоллКипер» принимает все необходимые меры для защиты любых персональных
                    данных, предоставляемых компании. Доступ к персональным данным имеют только
                    уполномоченные сотрудники, уполномоченные сотрудники сторонних компаний
                    (деловых партнеров), подписавшие соглашение о конфиденциальности и защите
                    персональных данных. Все сотрудники ООО «КоллКипер», имеющие доступ к
                    персональным данным, должны придерживаться политики по обеспечению
                    конфиденциальности и защиты персональных данных. В целях обеспечения
                    конфиденциальности информации и защиты персональных данных ООО «КоллКипер»
                    принимает все меры, необходимые для предотвращения несанкционированного доступа.
                    Кроме того, персональные данные могут передаваться государственным органам в тех
                    случаях, если ООО «КоллКипер» вынуждено сделать это в соответствии с требованиями
                    применимого законодательства, либо если, по мнению ООО «КоллКипер», такое действие
                    необходимо для соблюдения законности, выполнения законно обоснованных требований,
                    либо в целях защиты прав ООО «КоллКипер», его заказчиков и потребителей. Все
                    контрагенты ООО «КоллКипер», которым могут быть переданы Ваши персональные
                    данные действуют в соответствии с договором, налагающим на них соответствующие
                    правовые обязательства. Такие контрагенты обеспечивают высокий стандарт в сфере
                    защиты персональных данных, и гарантируют принятие всех технических мер,
                    необходимых для безопасного хранения персональных данных на протяжении всего
                    предусмотренного периода. В соответствии с Федеральным законом РФ № 152-ФЗ «О
                    персональных данных» хранение персональных данных в ООО «КоллКипер»
                    осуществляется в форме, позволяющей определить субъекта персональных данных, не
                    дольше, чем этого требуют цели их обработки, и они подлежат уничтожению по
                    достижении целей обработки или в случае утраты необходимости в их достижении.
                    Пользователь может потребовать удалить, исправить или проверить персональные данные
                    путем отправки электронного сообщения или письма по адресу, i@callkeeper.ru, либо
                    позвонить по телефону. Контактная информация: ООО «КоллКипер» 140003, Московская
                    обл, Люберецкий р-н, г Люберцы, ул 3-е Почтовое отделение, д 98, офис 117 Тел.: +7
                    495 989-84-74.
                    <br>
                    <br>
                    <b>Отказ предоставления</b>
                    <br>
                    <br>
                    Мы предоставляем Вам возможность отказаться от предоставления нам Ваших
                    персональных данных, когда мы запрашиваем их.
                    <br>
                    Если Вы решите отказаться от предоставления персональных данных, мы не сможем
                    предоставлять Вам доступ к Сервису CallKeeper.
                    <br>
                    Отказ от предоставления Ваших персональных данных Вы можете отправить по адресу
                    i@callkeeper.ru
                    <br>
                    <br>
                    <b>Удаление</b>
                    <br>
                    <br>
                    Вы можете запросить удаление Ваших персональных данных из Сервиса CallKeeper.
                    По такому запросу мы удалим все собранные о Вас персональные данные и не сможем
                    более предоставлять доступ к Сервису CallKeeper.
                    <br>
                    <br>
                    Для удаления персональных данных о Вас, обратитесь по адресу i@callkeeper.ru
                    <br>
                    <br>
                    Мы можем отказаться обрабатывать запросы, которые необоснованно повторяются или
                    систематичны, требуют непропорциональных технических усилий (например, запросов,
                    касающихся данных, хранящейся на резервных носителях), ставящих под угрозу
                    конфиденциальность других пользователей. В любом случае, когда мы удаляем или
                    изменяем данные, мы выполняем эту услугу бесплатно, за исключением случаев, когда
                    это потребует непропорциональных усилий.
                    <br>
                    <br>
                    Обратите внимание, что данные, которые не относятся к персональным могут
                    сохраняться, даже если вы прекратите использование Сервиса CallKeeper или запросите
                    удаление персональных данных.
                    <br>
                    <br>
                    <b>Согласие</b>
                    <br>
                    <br>
                    Вы можете отказаться от получения информационных и рекламных материалов
                    от CallKeeper. Для этого воспользуйтесь соответствующей настройкой «отписаться»
                    в рассылаемых материалах, или напишите свой запрос по адресу i@callkeeper.ru
                    <br>
                    <br>
                    <b>Файлы cookies</b>
                    <br>
                    <br>
                    Файлы cookie представляют собой небольшие текстовые файлы, которые сохраняются в
                    браузере Вашего компьютера или мобильного телефона после посещения веб-сайтов.
                    Файлы cookie широко применяются для поддержания работы веб-сайтов или для
                    повышения качества пользовательского опыта, а также для предоставления определенной
                    информации владельцам веб-сайта. Файлы cookie, которые используем мы, могут
                    включать в себя информацию о Ваших предпочтениях в Интернете, чтобы мы могли
                    сделать наш веб-сайт максимально интересным для Вас.
                    <br>
                    <br>
                    Персональные данные сохраняются в cookies только в том случае, если Вы даете на это
                    разрешение, например, чтобы облегчить защищенный доступ в Интернет и не вводить
                    повторно ID пользователя и пароль. Просмотры нашего сайта возможны и без cookies. В
                    большинстве браузеров прием cookies осуществляется автоматически.
                    <br>
                    <br>
                    Как можно разрешить или запретить использование файлов cookie?
                    <br>
                    <br>
                    В настройках своего устройства пользователь может разрешить использование всех
                    файлов cookie, установить уведомление об использовании файлов cookie или запретить
                    использование файлов cookie в любое время. Последняя из перечисленных настроек
                    означает, что пользователю не будут предоставляться определенные
                    персонализированные услуги, и пользователь, соответственно, не сможет воспользоваться
                    всеми преимуществами нашего веб-сайта.
                    <br>
                    <br>
                    В настройках браузера также можно запретить любые файлы cookie или только
                    определенные файлы cookie. Однако все браузеры отличаются друг от друга, поэтому
                    более подробная информация о настройках для файлов cookie приведена в разделе Help
                    («Справка») Вашего браузера. Блокировка приема cookies, однако, может привести к
                    ограничению доступа к сервисам, которые предоставляются на нашем сайте.
                    <br>
                    <br>
                    <b>Как мы используем файлы cookies?</b>
                    <br>
                    <br>
                    Информация, которую мы собираем с помощью файлов cookie, помогает нам
                    анализировать то, как Вы используете наш веб-сайт, а также позволяет нам повысить
                    качество пользовательского опыта при посещении нашего сайта. Мы никогда не
                    используем информацию, собранную с помощью файлов cookie, для идентификации
                    Вашей личности или рассылки рекламы по электронной или обычной почте.
                    <br>
                    <br>
                    Вы можете в любой момент обратиться к нам для удаления, изменения и предоставления
                    Ваших персональных данных. Для этого обратитесь по адресу: i@callkeeper.ru с
                    соответствующим запросом.
                    <br>
                    <br>
                    <b>Конфиденциальность детей</b>
                    <br>
                    <br>
                    Только лица, достигшие 18-летнего возраста, имеют разрешение на доступ к Сервису
                    CallKeeper. Сервис CallKeeper не обращается ни к кому в возрасте до 13 лет («Дети»).
                    Мы не сознательно собираем личную информацию от детей младше 13 лет. Если
                    вы являетесь родителем или опекуном, и вы узнаете, что ваши дети предоставили нам
                    личную информацию, пожалуйста, свяжитесь с нами. Если мы узнаем, что мы собрали
                    личную информацию от ребенка в возрасте до 13 лет без подтверждения родительского
                    согласия, мы принимаем меры для удаления этой информации с наших серверов.
                    <br>
                    <br>
                    <b>Безопасность.</b>
                    <br>
                    <br>
                    В целях защиты администрируемых нами Ваших данных от манипуляций, потери,
                    разрушения и несанкционированного доступа ООО «КоллКипер» принимает целый ряд
                    технических и организационных мер безопасности. По мере технического прогресса эти
                    меры безопасности постоянно совершенствуются.
                    <br>
                    <br>
                    <b>Принятие условий настоящего Соглашения.</b>
                    <br>
                    <br>
                    Настоящее Соглашение простым и доступным способом предоставляет всю информацию,
                    необходимую для принятия взвешенного решения о целесообразности использования
                    нашего веб-сайта и передачи персональных данных ООО «КоллКипер». Таким образом,
                    при посещении нашего веб-сайта и взаимодействии с нами с использованием электронных
                    средств Вы подтверждаете возможность обработки предоставленных персональных
                    данных и вторичных персональных данных (в т.ч. файлов cookies, данных о подключении
                    и системной информации) и соглашаетесь на их обработку в соответствии с принципами,
                    изложенными в настоящем Соглашении. В случае запроса на предоставление
                    определенных услуг компании дополнительно потребуются прямые персональные данные
                    (имя, телефон, адрес и адрес электронной почты). Эти персональные данные будут
                    использоваться только в тех целях, в которых они предоставляются ООО «КоллКипер».
                    <br>
                    <br>
                    <b>Изменения настоящем Соглашении.</b>
                    <br>
                    <br>
                    Мы оставляем за собой право обновлять или изменять настоящее соглашение в любое
                    время, и Вы должны периодически проверять его. Ваше дальнейшее использование
                    Сервиса после внесения любых изменений на этой странице будет означать Ваше
                    подтверждение изменений и Ваше согласие соблюдать его условия. Если мы внесем
                    какие-либо существенные изменения, мы уведомим Вас либо через адрес электронной
                    почты, который Вы нам предоставили, либо разместив заметное уведомление на нашем
                    веб-сайте.
                    <br>
                    <br>
                    <b>Оговорка</b>
                    <br>
                    <br>
                    ООО «КоллКипер» ведет деятельность на территории Российской Федерации в
                    соответствии с законодательством Российской Федерации. Предлагаемые услуги
                    доступны к получению на территории Российской Федерации. Мониторинг
                    потребительского поведения субъектов, находящихся за пределами Российской
                    Федерации не ведется.
                    <br>
                    <br>
                    Более подробную информацию о внутренних процессах обработки персональных данных
                    ООО «КоллКипер» вы можете получить тут.
                </div>

            </div>
        </div>
    </div>

</template>

<script>
    export default {
        name: '',
        props: ['type'],
        methods: {
            hideSelf() {
                this.$emit('close');
            }
        }
    }
</script>

<style scoped lang="scss">
    .blacking {
        position: fixed;
        z-index: 500;
        top: -100vh;
        left: -100vw;
        bottom: -100vw;
        right: -100vh;
        background: #000;
        opacity: 0.5;
        cursor: default;
    }

    .agreement-container {
        top: 30px;
        height: calc(100vh - 90px);
        left: 15px;
        width: calc(100vw - 30px);
        position: fixed;
        z-index: 1200;
        background: #fff;
        padding: 40px 20px;
        cursor: default;
        color: #000;
        font-family: "LADA Pragmatica", sans-serif;
    }

    .close {
        position: absolute;
        font-size: 20px;
        top: 10px;
        right: 15px;
        cursor: pointer;
    }

    .agreement-header {
        font-size: 16px;
        font-weight: 600;
        text-align: center;
        margin-bottom: 20px;
        text-transform: uppercase;
    }

    .agreement-part {
        margin-bottom: 10px;
    }

    .agreement-text {
        font-size: 14px;
        overflow: auto;
        max-height: 100%;
    }
</style>
